code-review/NRB_3471_3546/База_Было/Enums/СобытияКонтроляПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СобытияКонтроляПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведенииСЗапретом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/НастройкиОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FTPАдресОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортFTPСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательFTPСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольFTPСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеFTPСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьПриемаОтправкиСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПроксиFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПроксиFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПроксиFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПроксиFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколПроксиFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСМСШлюза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСМСШлюза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСМСШлюза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераПолучателейСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателяКопии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисАдрес</Name>
					<Comment>Адрес вебсервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисПользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисПароль</Name>
					<Comment>Пароль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисПространствоИмен</Name>
					<Comment>Пространство имен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисИмяСервиса</Name>
					<Comment>Имя сервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисИмяТочкиПодключения</Name>
					<Comment>Имя точки подключения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисАдресВКонфигурации</Name>
					<Comment>Получение xsd схемы из вебсервиса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисТаймаут</Name>
					<Comment>Таймаут</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисАвторизацияОС</Name>
					<Comment>Использовать авторизацию ОС при подключении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисРасширенноеЛогирование</Name>
					<Comment>Расширенное логирование в РС "Регистрация интеграционных событий". Если флаг не стоит, то фиксируются только ошибки.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервисЛогированиеСообщений</Name>
					<Comment>Необходимость фиксации в РС "Сообщения обмена со смежными системами"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисАдресСервера</Name>
					<Comment>Адрес сервера HTTP-сервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисПорт</Name>
					<Comment>Порт HTTP-сервиса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисПользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисПароль</Name>
					<Comment>Пароль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисТаймаут</Name>
					<Comment>Таймаут</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисЗащищенноеСоединение</Name>
					<Comment>Защищенное соединение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисАдресРесурса</Name>
					<Comment>Адрес ресурса HTTP-сервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPСервисАдресРесурсаАутентификации</Name>
					<Comment>Адрес ресурса аутентификации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийИсточникПриемаОтправкиСообщений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaТопик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KafkaПодписчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/УправлениеЭлектроннойПочтой/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СПИСКАМИ КОДИРОВОК

// Функция возвращает таблицу имен кодировок
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   Таблица значений
//
Функция ПолучитьТаблицуКодировок()

	ТаблицаКодировок = Новый ТаблицаЗначений;
	ТаблицаКодировок.Колонки.Добавить("Имя");
	ТаблицаКодировок.Колонки.Добавить("Представление");
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "ibm852";
	НоваяСтрока.Представление = "ibm852 (Центральноевропейская DOS)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "ibm866";
	НоваяСтрока.Представление = "ibm866 (Кириллица DOS)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-1";
	НоваяСтрока.Представление = "iso-8859-1 (Западноевропейская ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-2";
	НоваяСтрока.Представление = "iso-8859-2 (Центральноевропейская ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-3";
	НоваяСтрока.Представление = "iso-8859-3 (Латиница 3 ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-4";
	НоваяСтрока.Представление = "iso-8859-4 (Балтийская ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-5";
	НоваяСтрока.Представление = "iso-8859-5 (Кириллица ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-7";
	НоваяСтрока.Представление = "iso-8859-7 (Греческая ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-9";
	НоваяСтрока.Представление = "iso-8859-9 (Турецкая ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "iso-8859-15";
	НоваяСтрока.Представление = "iso-8859-15 (Латиница 9 ISO)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "koi8-r";
	НоваяСтрока.Представление = "koi8-r (Кириллица KOI8-R)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "koi8-u";
	НоваяСтрока.Представление = "koi8-u (Кириллица KOI8-U)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "us-ascii";
	НоваяСтрока.Представление = "us-ascii США";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "utf-8";
	НоваяСтрока.Представление = "utf-8 (Юникод UTF-8)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1250";
	НоваяСтрока.Представление = "windows-1250 (Центральноевропейская Windows)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1251";
	НоваяСтрока.Представление = "windows-1251 (Кириллица Windows)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1252";
	НоваяСтрока.Представление = "windows-1252 (Западноевропейская Windows)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1253";
	НоваяСтрока.Представление = "windows-1253 (Греческая Windows)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1254";
	НоваяСтрока.Представление = "windows-1254 (Турецкая Windows)";
	
	НоваяСтрока = ТаблицаКодировок.Добавить();
	НоваяСтрока.Имя           = "windows-1257";
	НоваяСтрока.Представление = "windows-1257 (Балтийская Windows)";
	
	Возврат ТаблицаКодировок;

КонецФункции

// Функция возвращает список кодировок
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокКодировок() Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	ТаблицаКодировок = ПолучитьТаблицуКодировок();
	Для каждого СтрокаТаблицы Из ТаблицаКодировок Цикл
		СписокЗначений.Добавить(СтрокаТаблицы.Имя, СтрокаТаблицы.Представление);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОЧТА

// Формирует почтовый профиль по учетной записи
//
// Параметры
//  УчетнаяЗапись
//
// Возвращаемое значение:
//   ИнтернетПочтовыйПрофиль
//
Функция ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись) Экспорт

	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераPOP3 = УчетнаяЗапись.POP3Сервер;
	Профиль.АдресСервераSMTP = УчетнаяЗапись.SMTPСервер;
	Если УчетнаяЗапись.ВремяОжиданияСервера > 0 Тогда
		Профиль.ВремяОжидания = УчетнаяЗапись.ВремяОжиданияСервера;
	КонецЕсли; 
	Профиль.Пароль           = УчетнаяЗапись.Пароль;
	Профиль.Пользователь     = УчетнаяЗапись.Логин;
	Профиль.ПортPOP3         = УчетнаяЗапись.ПортPOP3;
	Профиль.ПортSMTP         = УчетнаяЗапись.ПортSMTP;
	
	Если УчетнаяЗапись.ТребуетсяSMTPАутентификация Тогда
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		Профиль.ПарольSMTP         = УчетнаяЗапись.ПарольSMTP;
		Профиль.ПользовательSMTP   = УчетнаяЗапись.ЛогинSMTP;
	Иначе
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
	КонецЕсли; 
	
	Возврат Профиль;

КонецФункции

Процедура ОтправитьСообщениеПолучателям(Настройка, ТемаСообщения, ТекстСообщения, Вложения = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Настройка) = Тип("СправочникСсылка.НастройкиОбменаДанными") Тогда
		АктуальнаяУчетнаяЗаписьОтправки = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(Настройка);
	Иначе
		АктуальнаяУчетнаяЗаписьОтправки = Настройка.УчетнаяЗаписьПриемаОтправкиСообщений;
	КонецЕсли;
	УправлениеЭлектроннойПочтой.ИнтернетПисьмо(АктуальнаяУчетнаяЗаписьОтправки, ТемаСообщения, Настройка.АдресПолучателя, ТекстСообщения, Вложения);
	
КонецПроцедуры // ОтправитьСообщениеПолучателям()

Процедура ИнтернетПисьмо(УчетнаяЗаписьПриемаОтправкиСообщений, Тема, СписокПолучателей, ТекстПисьма, Вложения = Неопределено) Экспорт

	Перем Профиль, ИнтернетПочта;

	Профиль = ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьПриемаОтправкиСообщений);
	
	ИмяОтправителя = УчетнаяЗаписьПриемаОтправкиСообщений.ЛогинSMTP;

	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.СпособКодированияНеASCIIСимволов = СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения.MIME;

	Письмо.Отправитель.Адрес = УчетнаяЗаписьПриемаОтправкиСообщений.АдресЭлектроннойПочты;
	Письмо.Отправитель.ОтображаемоеИмя = УчетнаяЗаписьПриемаОтправкиСообщений.Наименование;
	
	ПозицияСимвола = Найти(ИмяОтправителя, "@");
	Письмо.ИмяОтправителя = ?(ПозицияСимвола > 0, Лев(ИмяОтправителя,ПозицияСимвола-1), ИмяОтправителя);
	Если ПозицияСимвола > 0 Тогда
		Письмо.Отправитель.Сервер = Прав(ИмяОтправителя, СтрДлина(ИмяОтправителя) - ПозицияСимвола);
		Письмо.Отправитель.Пользователь = Письмо.ИмяОтправителя;
	КонецЕсли;
	
	Письмо.Тема = ТемаПисьмаСИсточником(Тема);
	
	Если ТипЗнч(СписокПолучателей) = Тип("СписокЗначений") Тогда
		
		Для Каждого Адрес Из СписокПолучателей Цикл
			Письмо.Получатели.Добавить(Адрес.Значение);
		КонецЦикла;
		
	ИначеЕсли  ТипЗнч(СписокПолучателей) = Тип("Строка") Тогда
		
		МассивАдресовПолучателей = ПроцедурыУправленияПерсоналом.РазложитьСтрокуВМассивПодстрок(СписокПолучателей, ";");
		Для Каждого АдресПолучателя Из МассивАдресовПолучателей Цикл
			Письмо.Получатели.Добавить(СокрЛП(АдресПолучателя));
		КонецЦикла;
		
	ИначеЕсли  ТипЗнч(СписокПолучателей) = Тип("Массив") Тогда
		
		Для Каждого ЭлементАдресПолучателя Из СписокПолучателей Цикл
			Если ТипЗнч(ЭлементАдресПолучателя) = Тип("Строка") Тогда
				АдресПолучателя = ЭлементАдресПолучателя;
			ИначеЕсли ТипЗнч(ЭлементАдресПолучателя) = Тип("Структура") 
						И ЭлементАдресПолучателя.Свойство("Адрес") Тогда
				АдресПолучателя = ЭлементАдресПолучателя.Адрес;
			Иначе
				Продолжить;
			КонецЕсли;
			Письмо.Получатели.Добавить(СокрЛП(АдресПолучателя));
		КонецЦикла;
		
	КонецЕсли;

	Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.ПростойТекст);
	Если ТипЗнч(Вложения) = Тип("СписокЗначений") Тогда
		Для Каждого Адрес Из Вложения Цикл
			Письмо.Вложения.Добавить(Адрес.Значение);
		КонецЦикла;
	КонецЕсли;

	Письмо.ОбработатьТексты();

	ИнтернетПочта = Новый ИнтернетПочта;

	Попытка
		ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Письмо);
		ИнтернетПочта.Отключиться();
	Исключение
		ЗаписьЖурналаРегистрации(ОписаниеОшибки(), УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;

КонецПроцедуры

// Возвращает Тему письма с источником (для тестовых баз)
//
// Параметры:
//  Тема			 - Строка	 - Оригинальное название Темы
//  ЭтоТестоваяБаза	 - Булево	 - Признак тестовой базы
// 
// Возвращаемое значение:
//   - Строка - Для "Прод": просто Тема; для остальных баз: Тема + «Отправлено с UAT» + Имя базы
//
Функция ТемаПисьмаСИсточником(Знач Тема, ЭтоТестоваяБаза = Ложь) Экспорт
	
	Если ЭтоТестоваяБаза Или Привилегированный.ЭтоТестоваяБаза() Тогда
		ШаблонТемы = "%1%2(Отправлено с UAT) [%3]";
		Разделитель = ?(ПустаяСтрока(Тема), "", " ");
		Тема = СтрШаблон(ШаблонТемы, Тема, Разделитель, ПараметрыСеанса.ТекущаяИнформационнаяБаза);
	КонецЕсли;
	
	Возврат Тема;
КонецФункции

// Преобразовывает внутренние форматы вложений к двоичным данным.
//
Функция ПривестиВложениеДляВставкиВПисьмо(Вложение) Экспорт
	Если ТипЗнч(Вложение) = Тип("Строка") И ЭтоАдресВременногоХранилища(Вложение) Тогда
		Вложение = ПолучитьИзВременногоХранилища(Вложение);
		ПривестиВложениеДляВставкиВПисьмо(Вложение);
		Возврат Истина;
	ИначеЕсли ТипЗнч(Вложение) = Тип("Картинка") Тогда
		Вложение = Вложение.ПолучитьДвоичныеДанные();
		Возврат Истина;
	ИначеЕсли ТипЗнч(Вложение) = Тип("Файл") И Вложение.Существует() И Вложение.ЭтоФайл() Тогда
		Вложение = Новый ДвоичныеДанные(Вложение.ПолноеИмя);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// Процедура - Отправить сообщения контроля поручений по электронной почте
//
// Параметры:
//	СсылкаНаПоручение - ДокументСсылка.Поручение
//	СообщенияКонтроля	 - Массив	 - Массив структур с ключами СообщениеКонтроля (строка)
//										и СобытиеКонтроля (ПеречислениеСсылка.СобытияКонтроляПоручений)
Процедура ОтправитьСообщенияКонтроляПорученийПоЭлектроннойПочте(СсылкаНаПоручение, СообщенияКонтроля) Экспорт
	Если СообщенияКонтроля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСрабатыванииКонтроляПоручений;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника " + ВнешнийИсточник;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ИмяСобытия = "Уведомления о срабатывании контроля поручения";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ВнешнийИсточник, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СобытиеКонтроля = СообщенияКонтроля[0].СобытиеКонтроля;
	Пользователь = СообщенияКонтроля[0].Пользователь;
		
	Если СобытиеКонтроля = Перечисления.СобытияКонтроляПоручений.ПриПроведенииСЗапретом Тогда
		ОписаниеСобытия = "при ручном проведении (с запретом проведения)";
	ИначеЕсли СобытиеКонтроля = Перечисления.СобытияКонтроляПоручений.ПриПроведении Тогда
		ОписаниеСобытия = "при ручном проведении";
	Иначе
		ОписаниеСобытия = "при записи";
	КонецЕсли;
	
	ТемаПисьма = "Сработал контроль " + ОписаниеСобытия + " документа " + Строка(СсылкаНаПоручение);
	
	ТекстПисьма = "Сработал контроль " + ОписаниеСобытия + " пользователем " + Строка(Пользователь)
					+ " документа " + Строка(СсылкаНаПоручение) + Символы.ПС;
	Для Каждого РезультатКонтроля Из СообщенияКонтроля Цикл
		Если РезультатКонтроля.ОтправкаУведомленияПоЭлектроннойПочте Тогда
			ТекстПисьма = ТекстПисьма + Символы.ПС + " - " + РезультатКонтроля.СообщениеКонтроля;
		КонецЕсли;
	КонецЦикла; 
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
КонецПроцедуры
